Ran Plan for 4 projects:

1. dir: `terraform/ecr` workspace: `default`
1. dir: `terraform/ecs-service` workspace: `default`
1. dir: `terraform/elasticache-redis` workspace: `default`
1. dir: `terraform/sqs-queue` workspace: `default`
---

### 1. dir: `terraform/ecr` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/ecr/default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/ecr": exit status 1
╷
│ Error: Reference to undeclared resource
│ 
│   on outputs.tf line 7, in output "repository_url":
│    7:   value       = aws_ecr_repository.fileflow.repository_url
│ 
│ A managed resource "aws_ecr_repository" "fileflow" has not been declared in
│ the root module.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on outputs.tf line 12, in output "repository_arn":
│   12:   value       = aws_ecr_repository.fileflow.arn
│ 
│ A managed resource "aws_ecr_repository" "fileflow" has not been declared in
│ the root module.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on outputs.tf line 17, in output "repository_name":
│   17:   value       = aws_ecr_repository.fileflow.name
│ 
│ A managed resource "aws_ecr_repository" "fileflow" has not been declared in
│ the root module.
╵
╷
│ Error: Reference to undeclared resource
│ 
│   on outputs.tf line 22, in output "registry_id":
│   22:   value       = aws_ecr_repository.fileflow.registry_id
│ 
│ A managed resource "aws_ecr_repository" "fileflow" has not been declared in
│ the root module.
╵

```
</details>

---
### 2. dir: `terraform/ecs-service` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/ecs-service/default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/ecs-service": exit status 1
╷
│ Error: Error acquiring the state lock
│ 
│ Error message: operation error DynamoDB: PutItem, https response error
│ StatusCode: 400, RequestID:
│ 1E0UTR9JA1C1BK8G1E11UEDST7VV4KQNSO5AEMVJF66Q9ASUAAJG,
│ ConditionalCheckFailedException: The conditional request failed
│ Lock Info:
│   ID:        b76314d5-4b7b-24d7-d139-63df3be7831f
│   Path:      prod-connectly/fileflow/ecs-service/terraform.tfstate
│   Operation: OperationTypePlan
│   Who:       sangwon-ryu@lyusang-won-ui-MacBookPro.local
│   Version:   1.12.2
│   Created:   2025-11-10 06:58:26.583471 +0000 UTC
│   Info:      
│ 
│ 
│ Terraform acquires a state lock to protect the state from being written
│ by multiple users at the same time. Please resolve the issue above and try
│ again. For most commands, you can disable locking with the "-lock=false"
│ flag, but this is not recommended.
╵

```
</details>

---
### 3. dir: `terraform/elasticache-redis` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.redis_engine must be replaced
-/+ resource "aws_cloudwatch_log_group" "redis_engine" {
      ~ arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/elasticache/fileflow-redis-prod/engine-log" -> (known after apply)
      ~ id                = "/aws/elasticache/fileflow-redis-prod/engine-log" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/elasticache/fileflow-redis-prod/engine-log" -> "/aws/elasticache/crawlinghub-redis-prod/engine-log" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
            "Component"   = "cloudwatch-logs"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "log-fileflow-redis-prod-engine" -> "log-crawlinghub-redis-prod-engine"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all          = {
          ~ "Name"        = "log-fileflow-redis-prod-engine" -> "log-crawlinghub-redis-prod-engine"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.redis_slow must be replaced
-/+ resource "aws_cloudwatch_log_group" "redis_slow" {
      ~ arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/elasticache/fileflow-redis-prod/slow-log" -> (known after apply)
      ~ id                = "/aws/elasticache/fileflow-redis-prod/slow-log" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/elasticache/fileflow-redis-prod/slow-log" -> "/aws/elasticache/crawlinghub-redis-prod/slow-log" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
            "Component"   = "cloudwatch-logs"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "log-fileflow-redis-prod-slow" -> "log-crawlinghub-redis-prod-slow"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all          = {
          ~ "Name"        = "log-fileflow-redis-prod-slow" -> "log-crawlinghub-redis-prod-slow"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.cpu_utilization must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cpu_utilization" {
      - alarm_actions                         = [] -> null
      ~ alarm_name                            = "fileflow-redis-prod-cpu-utilization" -> "crawlinghub-redis-prod-cpu-utilization" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:fileflow-redis-prod-cpu-utilization" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          - "CacheClusterId" = "fileflow-redis-prod"
        } -> (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "fileflow-redis-prod-cpu-utilization" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      ~ tags                                  = {
            "Component"   = "cloudwatch-alarm"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "fileflow-redis-prod-cpu-alarm" -> "crawlinghub-redis-prod-cpu-alarm"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all                              = {
          ~ "Name"        = "fileflow-redis-prod-cpu-alarm" -> "crawlinghub-redis-prod-cpu-alarm"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.memory_utilization must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "memory_utilization" {
      - alarm_actions                         = [] -> null
      ~ alarm_name                            = "fileflow-redis-prod-memory-utilization" -> "crawlinghub-redis-prod-memory-utilization" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:fileflow-redis-prod-memory-utilization" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
          - "CacheClusterId" = "fileflow-redis-prod"
        } -> (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "fileflow-redis-prod-memory-utilization" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      ~ tags                                  = {
            "Component"   = "cloudwatch-alarm"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "fileflow-redis-prod-memory-alarm" -> "crawlinghub-redis-prod-memory-alarm"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all                              = {
          ~ "Name"        = "fileflow-redis-prod-memory-alarm" -> "crawlinghub-redis-prod-memory-alarm"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # aws_elasticache_cluster.main must be replaced
-/+ resource "aws_elasticache_cluster" "main" {
      + apply_immediately          = (known after apply)
      ~ arn                        = "arn:aws:elasticache:ap-northeast-2:646886795421:cluster:fileflow-redis-prod" -> (known after apply)
      ~ availability_zone          = "ap-northeast-2a" -> (known after apply)
      ~ az_mode                    = "single-az" -> (known after apply)
      ~ cache_nodes                = [
          - {
              - address           = "fileflow-redis-prod.j9czrc.0001.apn2.cache.amazonaws.com"
              - availability_zone = "ap-northeast-2a"
              - id                = "0001"
              - port              = 6379
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      + cluster_address            = (known after apply)
      ~ cluster_id                 = "fileflow-redis-prod" -> "crawlinghub-redis-prod" # forces replacement
      + configuration_endpoint     = (known after apply)
      ~ engine_version_actual      = "7.0.7" -> (known after apply)
      ~ id                         = "fileflow-redis-prod" -> (known after apply)
      ~ ip_discovery               = "ipv4" -> (known after apply)
      ~ network_type               = "ipv4" -> (known after apply)
      ~ parameter_group_name       = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      ~ security_group_ids         = [
          - "sg-03e4b1f12a3bd2a18",
        ] -> (known after apply)
      ~ subnet_group_name          = "fileflow-redis-prod" -> "crawlinghub-redis-prod" # forces replacement
      ~ tags                       = {
            "Component"   = "elasticache-cluster"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all                   = {
          ~ "Name"        = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
      ~ transit_encryption_enabled = false -> (known after apply)
        # (9 unchanged attributes hidden)

      - log_delivery_configuration {
          - destination      = "/aws/elasticache/fileflow-redis-prod/engine-log" -> null
          - destination_type = "cloudwatch-logs" -> null
          - log_format       = "json" -> null
          - log_type         = "engine-log" -> null
        }
      - log_delivery_configuration {
          - destination      = "/aws/elasticache/fileflow-redis-prod/slow-log" -> null
          - destination_type = "cloudwatch-logs" -> null
          - log_format       = "json" -> null
          - log_type         = "slow-log" -> null
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/crawlinghub-redis-prod/engine-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/crawlinghub-redis-prod/slow-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

  # aws_elasticache_parameter_group.main must be replaced
-/+ resource "aws_elasticache_parameter_group" "main" {
      ~ arn         = "arn:aws:elasticache:ap-northeast-2:646886795421:parametergroup:fileflow-redis-prod" -> (known after apply)
      ~ id          = "fileflow-redis-prod" -> (known after apply)
      ~ name        = "fileflow-redis-prod" -> "crawlinghub-redis-prod" # forces replacement
      ~ tags        = {
            "Component"   = "parameter-group"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all    = {
          ~ "Name"        = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_elasticache_subnet_group.main must be replaced
-/+ resource "aws_elasticache_subnet_group" "main" {
      ~ arn         = "arn:aws:elasticache:ap-northeast-2:646886795421:subnetgroup:fileflow-redis-prod" -> (known after apply)
      ~ id          = "fileflow-redis-prod" -> (known after apply)
      ~ name        = "fileflow-redis-prod" -> "crawlinghub-redis-prod" # forces replacement
      ~ tags        = {
            "Component"   = "elasticache-subnet-group"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all    = {
          ~ "Name"        = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
      ~ vpc_id      = "vpc-0f162b9e588276e09" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.redis must be replaced
-/+ resource "aws_security_group" "redis" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-03e4b1f12a3bd2a18" -> (known after apply)
      ~ description            = "Security group for fileflow-redis-prod" -> "Security group for crawlinghub-redis-prod" # forces replacement
      ~ id                     = "sg-03e4b1f12a3bd2a18" -> (known after apply)
      ~ name                   = "fileflow-redis-prod-sg" -> "crawlinghub-redis-prod-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "646886795421" -> (known after apply)
      ~ tags                   = {
            "Component"   = "security-group"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "fileflow-redis-prod-sg" -> "crawlinghub-redis-prod-sg"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all               = {
          ~ "Name"        = "fileflow-redis-prod-sg" -> "crawlinghub-redis-prod-sg"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.redis_endpoint must be replaced
-/+ resource "aws_ssm_parameter" "redis_endpoint" {
      ~ arn             = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/fileflow/prod/redis/endpoint" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ description     = "Redis endpoint for fileflow" -> "Redis endpoint for crawlinghub"
      + has_value_wo    = (known after apply)
      ~ id              = "/fileflow/prod/redis/endpoint" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/fileflow/prod/redis/endpoint" -> "/crawlinghub/prod/redis/endpoint" # forces replacement
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow-redis-prod-endpoint" -> "ssm-crawlinghub-redis-prod-endpoint"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow-redis-prod-endpoint" -> "ssm-crawlinghub-redis-prod-endpoint"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
      ~ tier            = "Standard" -> (known after apply)
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_ssm_parameter.redis_port must be replaced
-/+ resource "aws_ssm_parameter" "redis_port" {
      ~ arn             = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/fileflow/prod/redis/port" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      ~ description     = "Redis port for fileflow" -> "Redis port for crawlinghub"
      + has_value_wo    = (known after apply)
      ~ id              = "/fileflow/prod/redis/port" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/fileflow/prod/redis/port" -> "/crawlinghub/prod/redis/port" # forces replacement
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow-redis-prod-port" -> "ssm-crawlinghub-redis-prod-port"
            "Owner"       = "platform-team@ryuqqq.com"
          ~ "Service"     = "fileflow" -> "crawlinghub"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow-redis-prod-port" -> "ssm-crawlinghub-redis-prod-port"
          ~ "Service"     = "fileflow" -> "crawlinghub"
            # (6 unchanged elements hidden)
        }
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 10 to destroy.

Changes to Outputs:
~ cluster_id           = "fileflow-redis-prod" -> (known after apply)
~ endpoint             = "fileflow-redis-prod.j9czrc.0001.apn2.cache.amazonaws.com" -> (known after apply)
~ engine_log_group     = "/aws/elasticache/fileflow-redis-prod/engine-log" -> "/aws/elasticache/crawlinghub-redis-prod/engine-log"
~ parameter_group_name = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
~ security_group_id    = "sg-03e4b1f12a3bd2a18" -> (known after apply)
~ slow_log_group       = "/aws/elasticache/fileflow-redis-prod/slow-log" -> "/aws/elasticache/crawlinghub-redis-prod/slow-log"
~ subnet_group_name    = "fileflow-redis-prod" -> "crawlinghub-redis-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/elasticache-redis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/elasticache-redis
  ```
Plan: 10 to add, 0 to change, 10 to destroy.

---
### 4. dir: `terraform/sqs-queue` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/34/default/terraform/sqs-queue": exit status 1

Initializing the backend...
╷
│ Error: Failed to get existing workspaces: S3 bucket "ryuqqq-terraform-state-prod" does not exist.
│ 
│ The referenced S3 bucket must have been previously created. If the S3 bucket
│ was created within the last minute, please wait for a minute or two and try
│ again.
│ 
│ Error: operation error S3: ListObjectsV2, https response error StatusCode: 404, RequestID: DY5H89DF86W3TK7S, HostID: NtorP58XMBd0F8C3MQkK3aZga/OK9hDUXSg1XT9k8OPfct7Dghn6XvD70EeucD+sj/iXm/vyK2HWxpJ8SVy/gIad9alP4PMlnH/+RGVJLEY=, NoSuchBucket: 
│ 
│ 
│ 
╵


```
</details>

---
### Plan Summary

4 projects, 1 with changes, 0 with no changes, 3 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```